app/controllers/documents_controller.rb

  def index
    @documents = if params[:name]
      Document.where('name LIKE ?', "%#{params[:name]}%")
    else
      Document.all
---
SELECT "documents".* FROM "documents" WHERE (name LIKE '%2nd%')
SELECT "documents".* FROM "documents"

  def create
    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save
---
INSERT INTO "documents" ("name", "start_date", "exp_date", "file", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["start_date", "2017-11-02"], ["exp_date", "2017-11-02"], ["file", "/files/"], ["created_at", "2017-11-02 10:57:46.308343"], ["updated_at", "2017-11-02 10:57:46.308343"]]

  def update
    respond_to do |format|
      if @document.update(document_params)
---
UPDATE "documents" SET "file" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["file", "passport_U.S..jpg"], ["updated_at", "2017-11-06 18:35:44.132905"], ["id", 3]]

  def destroy
    @document.destroy
---
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 1]]