app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "text", "done", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "jkldsf"], ["text", "skdfnk"], ["done", "t"], ["created_at", "2017-11-14 15:24:30.898454"], ["updated_at", "2017-11-14 15:24:30.898454"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save